{
  "timestamp": "2025-10-27T18:38:31.101410",
  "mode": "ultra_autonomous",
  "discovery_method": "discover.py_full_mode",
  "embeddings_used": true,
  "refined_goal": "Build PhishTrace, a local-first, LLM-free defensive agent that hardens a PC, blocks phishing reachability at the DNS layer, and forensically attributes infrastructure behind phishing attempts. The engine fuses three pillars: (1) a DoH/DoT secure DNS stub with programmable sinkholing and telemetry, (2) an embedding-driven URL/content scorer paired with a compact LSTM sequence model that learns the user’s normal process/network behavior to flag deviations, and (3) a playbook-driven attribution pipeline that extracts evidence (SPF/DKIM/DMARC, Received paths, TLS JA3/JA3S, RDAP/ASN, CT logs) into a cryptographically signed evidence pack. Success = >95% block rate on known phishing domains, <0.3% FP on benign URLs, <150 ms per decision, evidence packs that can be filed with abuse contacts automatically, and actionable cluster-level attribution (shared certs/ASN) within 2 minutes. This matters because it shifts defense left: prevent, detect, and generate admissible proof locally without cloud LLMs or surrendered privacy.",
  "repository_synergy": "THE INSIGHT: The most overlooked defense in consumer PCs is not yet another antivirus—it’s a programmable identity and routing layer. By fusing an encrypted DNS stack (paulmillr/encrypted-dns) with a policy-orchestration mindset borrowed from prompt collections (x1xhlol/system-prompts-and-models-of-ai-tools) and bootstrapping a trust/knowledge map from curated developer resources (sdmg15/Best-websites-a-programmer-should-visit), we get a system that both blocks and traces—without LLMs.\n\nTHE STORY: Most would pair encrypted-dns with a generic blocklist. We go further. The encrypted-dns repo gives us a lightweight, auditable DoH/DoT resolver baseline we can embed and extend: programmable name resolution, cache policies, and selective sinkholing. The system-prompts repo looks unrelated, but it is actually a goldmine of structured task grammars: sequences of tool invocations, conditions, and guardrails. Repurposed, those become machine-readable playbooks that drive our non-LLM orchestration—detectors, analyzers, and attribution steps. The Best-websites list? A maintained corpus of vetted, stable domains—perfect to bootstrap whitelists, lexical reputation, and to seed a trustworthy feature distribution for our embedding models. It also points to high-signal developer portals (docs, standards, OSINT references) used by attackers and defenders; we mine those to enrich our rule templates and to calibrate false-positive controls.\n\nTHE SYNERGY: Encrypted DNS is our programmable perimeter. We embed an embeddings+LSTM detector upstream of resolution: suspicious URLs never resolve in the wild; they get redirected to a local sink that safely records the attempted request details (without exfiltrating any data) and triggers a forensics playbook. The playbook uses the repurposed “prompt” semantics (but no LLM) as a simple DSL to choreograph steps like: parse email headers, compute SPF/DKIM/DMARC verdicts, pull RDAP/WHOIS, pivot via TLS cert fingerprint, map to ASN, and generate abuse-ready reports. Meanwhile, the Best-websites list seeds a baseline of known-good domain embeddings and a bias term for lexical similarity—immediately lowering FP rates and making the system useful on day one with zero user labeling.\n\nTHE INNOVATION: Turning a prompt corpus into a deterministic orchestration DSL is the illicit bridge. We hijack the idea of tool-augmented prompts and compile them to finite state machines and DAGs of local tools (not LLM calls), thereby enabling zero-cloud, reproducible, explainable security playbooks. Combining that with encrypted DNS gives us a unique path: prevent reachability, collect ground-truth telemetry, and attribute infrastructure—legally and locally—within seconds. No black-box cloud AI. No surrendering packet captures. Just a precise, extensible guardian for your PC.\n\nTHE BRIDGE: We encode system prompts as YAML/JSON action graphs: triggers (new domain, new email), conditions (SPF fail, DKIM absent), actions (RDAP lookup, JA3 calc, CT log query), outputs (evidence bundle, sinkhole rule). The encrypted-dns engine loads those rules hot and updates resolution behavior atomically. The Best-websites index feeds a vector store used by the URL scorer for trust priors and by the playbooks to choose authoritative data sources without human input. Three repos, three orthogonal strengths—composed into a self-bootstrapping, LLM-free cyber guardian.",
  "technical_architecture": "Components and data flow:\n- Local DNS Guardian (Rust): Built by extending the patterns from paulmillr/encrypted-dns. Provides DoH/DoT upstream with caching, QNAME minimization, ECS disabled, ECH-aware, plus programmable filters and a sinkhole endpoint. Exposes a UNIX/Named pipe + gRPC control API to push block/allow rules and to query resolution events.\n- URL & Content Risk Scorer (Python + ONNX): Two-stage. Stage A: lexical and host-based embedding model (e.g., MiniLM-L6-v2 or fastText) compiled to ONNX and quantized. Stage B: a compact 2-layer LSTM (hidden=64) trained locally on sequences of user-specific browsing/network events (n-gram of domains, ports, timing) as a next-event predictor; anomaly = high prediction error. Outputs a risk score in <2 ms per query on CPU using ONNX Runtime.\n- System Event Collector: Cross-platform. Windows: ETW + WFP to capture process start, DNS queries, TCP connect, TLS client hello (for JA3). Linux: eBPF (kprobes + tc) to capture connect/syscall + TLS fingerprints; macOS: Network Extension. Normalizes to a protobuf schema and streams to the Risk Scorer and Graph Store.\n- Evidence Graph Store (SQLite + sqlite-vec or FAISS): Stores entities (domains, IPs, certs, ASNs, emails), relationships (resolved_to, uses_cert, originates_from_received_header, hosted_in_asn), artifacts (headers, whois snapshots), and vectors (domain embeddings). Signed append-only logs (minisign) ensure tamper evidence for the evidence pack.\n- Playbook Orchestrator (Go or Rust): Reuses the conceptual structure from system-prompts-and-models-of-ai-tools, compiled to a deterministic DSL: triggers, guards, tools, outputs. Tools include: email header parser (SPF/DKIM/DMARC via dmarc-parser), RDAP/WHOIS client, CT log fetcher (optional local mirror), JA3/JA3S calculator, ASN mapping (MaxMind ASN DB), abuse contact resolver (RFC 2142 conventions + RDAP remarks). Orchestrator emits findings to the Evidence Graph and can file ARF (Abuse Reporting Format) emails.\n- Sinkhole Service (Rust/Node): HTTP/HTTPS local webserver bound to 127.0.0.1 that receives redirected requests for blocked domains; captures headers, user agent, referrer, and TLS parameters (no page content exfiltration). Generates sanitized previews and closes the loop back to Orchestrator.\n\nAPIs & Protocols:\n- gRPC Control: dns.AddRule(domain, action, ttl), dns.QueryLog(stream); orchestrator.SubmitArtifact(type, bytes); store.QueryGraph(cypher-lite), store.Similarity(vec, k).\n- Local IPC: ZeroMQ or NATS for event fan-out with backpressure; protocol buffers for schema stability.\n- Data Formats: Evidence packs as ZIP/AFF4 with JSON-LD nodes, minisign signatures, and chain-of-custody metadata.\n\nKey challenges and solutions:\n- Performance under load: Use Rust async (tokio) in DNS; prewarm ONNX sessions; batch event scoring; store vector indexes in memory-mapped files; lock-free ring buffers for event capture.\n- Cross-platform TLS fingerprinting: Avoid MITM; compute JA3 from ClientHello via pcap/eBPF/ETW handshake events; for QUIC, compute JA4/JA4-QUIC when feasible.\n- FP/TP balance without LLM: Combine embedding priors with per-user LSTM anomaly deltas; require multi-signal consensus (risk score + new ASN + young cert) before block, default to challenge (sinkhole) instead of hard drop.\n- Legal and ethical boundaries: No hacking back. Only local sinkholing and OSINT; provide built-in abuse report drafting and evidence sealing.\n- Repo integration: encrypted-dns patterns guide the DoH stack and configuration; system-prompts repo structure informs the playbook DSL and tool chaining; Best-websites list seeds the trust corpus and helps build a robust, low-noise whitelist and lexical prior.\n\nNon-obvious optimizations:\n- Progressive strictness: New processes and unknown browsers start with higher scrutiny until the LSTM stabilizes; dynamic TTL shrinkage for suspicious domains.\n- on-path learning: When the user marks a false positive, capture embeddings to a per-user trusted centroid; when marking malicious, expand the cluster using passive DNS pivots and update sinkhole rules atomically via the DNS API.\n- Edge caching of RDAP/CT: Maintain a small rolling cache of RDAP responses and CT leaf hashes to avoid noisy network calls during incidents.\n\nIntegration patterns:\n- Orchestrator compiles playbooks (from prompt-like YAML) into DAGs; nodes call tools; outputs push to dns.AddRule and store.Insert; the DNS guardian enforces and logs; the Risk Scorer subscribes to event streams and feeds alerts back into the Orchestrator for escalation. Everything runs locally; optional remote enrichment is proxied over the encrypted DNS channel or HTTPS with pinned certs.",
  "expected_impact": "Use cases:\n- Real-time phishing click interception: When a user clicks a link in a suspicious email, the DNS Guardian consults the embedding+LSTM score. If risky, it resolves to 127.0.0.1, displays a safe preview, and triggers the attribution playbook. The user sees a human-readable reason (young certificate, first-seen domain, mismatched ASN) within 1 second.\n- Email-origin tracing for incident response: The Thunderbird/Outlook plugin submits headers; the playbook reconstructs the Received chain, checks SPF/DKIM/DMARC, maps IPs to ASNs, correlates TLS cert reuse, and produces a signed evidence pack plus pre-filled abuse emails for the hoster and registrar.\n- Process-based anomaly detection: A sideloaded DLL spawns curl.exe at 3 a.m. The LSTM flags a deviation (new parent-child process chain + unusual timing), the DNS guardian auto-sinkholes outbound resolution, and the Orchestrator tags the process for review.\n- Developer-targeted supply-chain phishing: A fake documentation domain mimics a known developer site. The embedding model notes lexical proximity but the CT log check shows a just-issued DV cert and a new ASN block; policy upgrades to hard block, saving the click.\n- Controlled detonation with local sinkhole: A downloaded macro tries to beacon to abc-def-login[.]com. The DNS guardian routes to sinkhole; HTTP reveals a staging path pattern used in previous incidents; the Evidence Graph clusters it with two earlier attempts, enabling infrastructure-level reporting.\n- Offline-first protection: On a plane, with no internet, the LSTM and whitelist still function. Unknown domains get delayed-resolution mode; once online, the backlog is resolved via DoH with strict policies.\n- Team rollout: Profiles sync through signed evidence packs and rule bundles, not raw telemetry. A small team quickly adopts shared whitelists and playbooks without exposing personal browsing content.\n\nScalability and extensibility:\n- Add new tools to playbooks by registering binaries/APIs; the DSL accommodates guards, retries, and timeouts. Vector store scales with shards or FAISS; DNS guardian handles tens of thousands of QPS on a modern laptop.\n\nLimitations and mitigations:\n- Attribution uncertainty: OSINT can’t prove human identity. Mitigate by reporting at infrastructure level (ASN, registrar) and by clearly labeling confidence scores.\n- Encrypted SNI/ECH gaps: Some fingerprints may be hidden; mitigate by JA3/JA4 from ClientHello when observable and by certificate transparency where available.\n- FP risk in new-user phase: For the first week, show interstitials instead of hard blocks; learn the baseline quickly with larger stride windows.\n- Repository license alignment: Avoid linking GPL code directly; only reuse structural ideas and configuration patterns from prompt repo; embed encrypted-dns patterns and write fresh implementations where needed.",
  "innovation_analysis": "Innovation score: 8.5/10. The illicit bridge—recasting “system prompts” into a deterministic, LLM-free orchestration DSL—combined with a programmable encrypted DNS perimeter and an embedding+LSTM detector, is a genuinely non-obvious fusion. It creates a prevention-plus-attribution loop few consumer tools offer.\n\nNext steps:\n- Prototype the DNS Guardian with programmable sinkholes and gRPC control. Implement minimal playbook compiler (YAML to DAG) and two tools: email header analyzer and RDAP lookup. Integrate MiniLM ONNX embedding and a small LSTM baseline.\n- Build the evidence pack format with minisign and a simple viewer.\n- Ship a browser extension to feed URLs and a basic Outlook/Thunderbird add-in for header submission.\n\nKey metrics:\n- Time-to-decision (p95), block rate on known phishing, FP rate on whitelist, time-to-evidence pack, number of clustered incidents per campaign.\n\nEssential tools/frameworks:\n- Rust (tokio, trust-dns-like stack), ONNX Runtime, sqlite + sqlite-vec or FAISS, eBPF/ETW/WFP, minisign, Go/Rust for orchestrator, protobuf/gRPC, MaxMind ASN DB, dmarc-parser equivalents.",
  "sources": [
    {
      "name": "x1xhlol/system-prompts-and-models-of-ai-tools",
      "url": "https://github.com/x1xhlol/system-prompts-and-models-of-ai-tools",
      "description": "",
      "language": "module",
      "license": "GPL-3.0",
      "readme_snippet": "# **System Prompts and Models of AI Tools**  \n---\n<p align=\"center\">\n  <sub>Special thanks to</sub>  \n</p>\n\n<p align=\"center\">\n  <a href=\"https://latitude.so/developers?utm_source=github&utm_medium=readme&utm_campaign=prompt_repo_sponsorship\" target=\"_blank\">\n    <img src=\"assets/Latitude_logo.png\" alt=\"Latitude Logo\" width=\"700\"/>\n  </a>\n</p>\n\n<div align=\"center\" markdown=\"1\">\n\n### <a href=\"https://latitude.so/developers?utm_source=github&utm_medium=readme&utm_campaign=prompt_repo_sponsorship\" target=\"_blank\">The tools you need for building reliable Agents and Prompts</a>  \n<a href=\"https://latitude.so/developers?utm_source=github&utm_medium=readme&utm_campaign=prompt_repo_sponsorship\" target=\"_blank\">Open Source AI Engineering Platform</a><br>\n\n</div>\n\n---\n\n<a href=\"https://discord.gg/NwzrWErdMU\" target=\"_blank\">\n  <img src=\"https://img.shields.io/discord/1402660735833604126?label=LeaksLab%20Discord&logo=discord&style=for-the-badge\" alt=\"LeaksLab Discord\" />\n</a>\n\n> **Join the Conversation:** New system instructions are released on Discord **before** they appear in this repository. Get early access and discuss them in real time.\n\n\n<a href=\"https://trendshift.io/repositories/14084\" target=\"_blank\"><img src=\"https://trendshift.io/api/badge/repositories/14084\" alt=\"x1xhlol%2Fsystem-prompts-and-models-of-ai-tools | Trendshift\" style=\"width: 250px; height: 55px;\" width=\"250\" height=\"55\"/></a>\n\n📜 Over **30,000+ lines** of insights into their structure and functionality.  \n\n⭐ **Star to follow updates**\n\n[![Build Status](https://app.cloudback.it/badge/x1xhlol/system-prompts-and-models-of-ai-tools)](https://cloudback.it)\n[![Ask DeepWiki](https://deepwiki.com/badge.svg)](https://deepwiki.com/x1xhlol/system-prompts-and-models-of-ai-tools)\n\n---\n\n## ❤️ Support the Project\n\nIf you find this collection valuable and appreciate the effort involved in obtaining and sharing these insights, please consider supporting the project. Your contribution helps keep this resource updated and",
      "scores": {
        "novelty": 0.6447,
        "health": 0.0,
        "relevance": 0.8202,
        "author_rep": 0.0,
        "gem_score": 0.0
      },
      "concepts": [
        "-",
        "https",
        "ai",
        "--- ##",
        "./open 20source",
        "---",
        "href https",
        "##"
      ]
    },
    {
      "name": "sdmg15/Best-websites-a-programmer-should-visit",
      "url": "https://github.com/sdmg15/Best-websites-a-programmer-should-visit",
      "description": "",
      "language": "module",
      "license": "MIT",
      "readme_snippet": "<h1 align=\"center\">\n    <br>\n    <img width=\"200\" src=\"https://raw.githubusercontent.com/sindresorhus/awesome/main/media/logo.svg\" alt=\"awesome\">\n    <br>\n</h1>\n\n[![Build Status](https://api.travis-ci.org/sdmg15/Best-websites-a-programmer-should-visit.svg?branch=master)](https://travis-ci.org/sdmg15/Best-websites-a-programmer-should-visit)\n\n# Best-websites-a-programmer-should-visit\nSome useful websites for programmers.\n\nWhen learning CS, there are some useful sites you must know to get always informed to do your technologies even better and learn new things. Here is a non-exhaustive list of some sites you should visit. This list will get updated as soon as I can get another link, but you can also contribute by adding those you know :wink:\n\n**Note** : [Chinese Version](https://github.com/tuteng/Best-websites-a-programmer-should-visit-zh)\n\n## 📖 Index\n<ul>\n<li><a href=\"#-when-you-get-stuck\">When you get stuck</a></li>\n<li><a href=\"#-news\">News</a></li>\n<li><a href=\"#-magazines\">Magazines</a></li>\n<li><a href=\"#-coding-practice-for-beginners\">Coding practice for beginners</a></li>\n<li><a href=\"#-cryptocurrency\">Cryptocurrency</a></li>\n<li><a href=\"#-for-those-who-want-to-start-a-small-project-but-cant-find-the-ideas\">For those who want to start a small project but can't find the ideas</a></li>\n<li><a href=\"#-general-coding-advice\">General Coding advice</a></li>\n<li><a href=\"#-coding-style\">Coding Style</a></li>\n<li><a href=\"#-general-tools\">General Tools</a></li>\n<li><a href=\"#-interview-preparation\">Interview Preparation</a></li>\n<li><a href=\"#-documentaries\">Documentaries</a></li>\n<li><a href=\"#-moocs-for-learning-something-new\">MOOCs for learning something new</a></li>\n<li><a href=\"#-sites-related-to-your-preferred-programming-language-for-me-c\">Sites related to your preferred programming language (For me C++)</a></li>\n<li><a href=\"#-learn-ai\">Artificial Intelligence And Machine Learning</a></li>\n<li><a href=\"#-seminar-research-writing-talks-etc\">Seminar , research w",
      "scores": {
        "novelty": 0.301,
        "health": 0.0,
        "relevance": 0.8087,
        "author_rep": 0.0,
        "gem_score": 0.0
      },
      "concepts": [
        "li href",
        "/a /li",
        "/li li",
        "-",
        "https",
        "href",
        "/a",
        "li"
      ]
    },
    {
      "name": "paulmillr/encrypted-dns",
      "url": "https://github.com/paulmillr/encrypted-dns",
      "description": "",
      "language": "module",
      "license": "Unlicense",
      "readme_snippet": "English | [简体中文](https://github.com/paulmillr/encrypted-dns/blob/master/README.cmn-CN.md) | [繁體中文](https://github.com/paulmillr/encrypted-dns/blob/master/README.cmn-TW.md)\n\n# encrypted-dns-configs\n\nConfiguration profiles for [DNS over HTTPS](https://en.wikipedia.org/wiki/DNS_over_HTTPS) and [DNS over TLS](https://en.wikipedia.org/wiki/DNS_over_TLS). Check out the article for more info: [paulmillr.com/posts/encrypted-dns/](https://paulmillr.com/posts/encrypted-dns/).\n\nProfiles are generated from simple `.json` files. Check out `providers` directory to add or edit a new profile.\n\n### Caveats\n\nKnown issues (we can't fix them, maybe Apple can):\n\n1. Applications (e.g. Firefox in specific regions; App Store in all regions) can choose to ignore the system-level resolver and use their own.\n   [Check out the discussion](https://github.com/paulmillr/encrypted-dns/issues/22).\n2. iCloud Private Relay, VPN clients & Little Snitch / LuLu will ignore the DNS profile.\n3. Command line tools that interact with DNS (e.g. `host`, `dig`, `nslookup`) won't use DoH -\n   will use the DNS severs set in Network, or picked up from DHCP.\n4. [Wi-Fi captive portals](https://en.wikipedia.org/wiki/Captive_portal) in cafes, hotels, airports are exempted by Apple from eDNS rules; to simplify authentication - this is good\n5. TLS DNS is blocked more often by ISPs than HTTPS, because TLS uses non-standard port 853, which is easy to block.\n   See [Google's article](https://security.googleblog.com/2022/07/dns-over-http3-in-android.html)\n\nCheck out [encrypted-dns over TOR](https://github.com/alecmuffett/dohot) if you need more privacy.\n\n## Providers\n\n`Censorship=yes` (also known as \"filtering\") means the profile will not send true information about `hostname=IP` relation for some hosts.\n\n| Name                                                                                 | Region | Censorship | Notes                                                                                                     | In",
      "scores": {
        "novelty": 0.1745,
        "health": 0.0,
        "relevance": 0.825,
        "author_rep": 0.0,
        "gem_score": 0.0
      },
      "concepts": [
        "https",
        "tls",
        "dns",
        "yes",
        "operated",
        "blahdns",
        "yes operated",
        "blocks"
      ]
    }
  ],
  "discovery_params": {
    "topics": [
      "hacking",
      "data",
      "phising"
    ],
    "custom_queries": [],
    "days": 50,
    "licenses": [
      "MIT",
      "Apache-2.0",
      "BSD-3-Clause",
      "BSD-2-Clause",
      "GPL-3.0",
      "GPL-2.0",
      "LGPL-3.0",
      "MPL-2.0",
      "ISC",
      "Unlicense",
      "0BSD"
    ],
    "max": 20,
    "explore_longtail": false,
    "max_stars": 100000,
    "min_health": 0.1,
    "require_ci": false,
    "require_tests": false,
    "authorsig": false,
    "embed_provider": "sbert",
    "embed_model": "thenlper/gte-small",
    "embed_max_chars": 8000,
    "goal": "Finds an engineering solution to protect your PC, including tracking down those who sent phishing attacks and attempted to enter your PC.the sofware has to be without LLM involved. but you can you embedding, or LSTM instead",
    "w_novelty": 0.35,
    "w_health": 0.25,
    "w_relevance": 0.25,
    "w_author": 0.05,
    "w_diversity": 0.15,
    "probe_limit": 20,
    "exclude_processed": true,
    "use_cache": false
  },
  "metrics": {
    "topics": [
      "hacking",
      "data",
      "phising"
    ],
    "days": 50,
    "explore_longtail": false,
    "probe_limit": 20,
    "candidates": 7,
    "probed": 7,
    "selected": 3,
    "weights": {
      "novelty": 0.35,
      "health": 0.25,
      "relevance": 0.25,
      "author": 0.05,
      "diversity": 0.15
    }
  },
  "blueprint": {
    "title": "GitRecombo — Out‑of‑Scale Blueprint",
    "summary": "Recombination of recent GitHub innovations with long-tail exploration, health/reputation signals, and optional semantic relevance.",
    "sources": [
      {
        "name": "x1xhlol/system-prompts-and-models-of-ai-tools",
        "url": "https://github.com/x1xhlol/system-prompts-and-models-of-ai-tools",
        "license": "GPL-3.0",
        "role": "module (NA)",
        "novelty_score": 0.6447,
        "relevance": 0.8202,
        "health_score": 0.0,
        "author_rep": 0.0,
        "concepts": [
          "-",
          "https",
          "ai",
          "--- ##",
          "./open 20source",
          "---",
          "href https",
          "##"
        ],
        "gem_score": 0.0
      },
      {
        "name": "sdmg15/Best-websites-a-programmer-should-visit",
        "url": "https://github.com/sdmg15/Best-websites-a-programmer-should-visit",
        "license": "MIT",
        "role": "module (NA)",
        "novelty_score": 0.301,
        "relevance": 0.8087,
        "health_score": 0.0,
        "author_rep": 0.0,
        "concepts": [
          "li href",
          "/a /li",
          "/li li",
          "-",
          "https",
          "href",
          "/a",
          "li"
        ],
        "gem_score": 0.0
      },
      {
        "name": "paulmillr/encrypted-dns",
        "url": "https://github.com/paulmillr/encrypted-dns",
        "license": "Unlicense",
        "role": "module (JavaScript)",
        "novelty_score": 0.1745,
        "relevance": 0.825,
        "health_score": 0.0,
        "author_rep": 0.0,
        "concepts": [
          "https",
          "tls",
          "dns",
          "yes",
          "operated",
          "blahdns",
          "yes operated",
          "blocks"
        ],
        "gem_score": 0.0
      }
    ],
    "architecture_ascii": "[1] x1xhlol/system-prompts-and-models-of-ai-tools  →  [2] sdmg15/Best-websites-a-programmer-should-visit  →  [3] paulmillr/encrypted-dns\n            ↓\n        [ Orchestrator ]",
    "seed_commands": [
      "mkdir -p app/{core,modules,scripts}",
      "echo '# Out-of-scale seed' > README.md",
      "python -m venv .venv && source .venv/bin/activate || .venv\\Scripts\\activate",
      "pip install -U uv pip wheel"
    ],
    "project_tree": [
      "app/",
      "app/core/",
      "app/modules/",
      "app/scripts/bootstrap.sh",
      "README.md"
    ],
    "why_it_works": [
      "Novelty + Health + Author signals + Semantic relevance elevate hidden gems.",
      "Diversity bonus avoids conceptual duplicates when embeddings are enabled.",
      "Permissive licensing keeps integration safe and fast."
    ],
    "metrics": {
      "topics": [
        "hacking",
        "data",
        "phising"
      ],
      "days": 50,
      "explore_longtail": false,
      "probe_limit": 20,
      "candidates": 7,
      "probed": 7,
      "selected": 3,
      "weights": {
        "novelty": 0.35,
        "health": 0.25,
        "relevance": 0.25,
        "author": 0.05,
        "diversity": 0.15
      }
    }
  }
}